<template>
  <div id="contract">
    <h2 class="title">房屋委托租赁合同阅读</h2>
    <p>
      委托人甲方：<span class="info">{{ contract.party_A }}</span>
    </p>
    <p>地址房号：<span class="info">{{ contract.address }}</span></p>
    <p>联系电话：<span class="info">{{ contract.phone }}</span></p>
    <p>受托人乙方：<span class="info">{{ contract.appointee }}</span></p>
    <p>
      根据《中华人民共和国合同法》相关规定为明确双方的权利、义务甲乙双方特订立本合同双方共同遵守
    </p>
    <p>
      第一条、甲方将位于<span class="info">{{ contract.address }}</span>，房屋所有权证号委托乙方作为甲方的独家代理全权代表甲方对其拥有的上述房屋提供租赁管理服务
    </p>
    <p>第二条、代理房屋租金标准由甲乙双方共同协商确定。</p>
    <p>
      甲方应根据一年租期支付相等于一个月房租全款的代理服务佣金给乙方。其中包括但不仅限于应支付给第三方的因房屋代理服务所产生的费用。如有其它费用支出甲乙双方另行协商。甲方应在该房屋出租7个工作日内支付代理费。
    </p>
    <p>第三条、甲方责任</p>
    <p>
      1、若甲方在租赁期内出售该房屋需提前两个月以书面形式告知乙方则本合同在甲方与新买受人之间的房屋买卖合同生效后自动结束但如房屋已出租的甲方应保证新买受人继续履行就该房屋签订的房屋租赁协议。
    </p>
    <p>
      2、甲方将协助乙方出具关于每个出租单位的有关收房、出租、交税、办理产权、租户办公注册等事项的委托书和相关文件、证明并委托乙方代替其签署在租赁过程中的所有相关法律文件如需上述文件按照有关部门的规定及要求需要公证的甲方应进行公证费用由甲方承担。
    </p>
    <p>
      3、乙方代理甲方签订的房屋租赁协议终止后及时将所收取的押金退还给乙方再由乙方返还给承租方。
    </p>
    <p>第四条、乙方责任</p>
    <p>
      1、乙方负责为甲方代理寻找租客并作为甲方代表代理甲方与承租方签署租赁合同并代收代缴押金房租公共事业费等各项费用。租赁合同原件一式三份甲方乙方及承租人各执一份。
    </p>
    <p>
      2、乙方受托甲方收取房租的乙方应在收到承租方支付房屋押金及房租三个工作日内根据本合同第三条的规定将扣除所有相关费用后的租金款项转至甲方指定的银行账户。
    </p>
    <p>
      3、乙方指定一名公司内部管理人员代表乙方与承租人签署租赁合同及代收押金及租金
    </p>
    <p>4、乙方为甲方提供的服务</p>
    <p>4.1、甲方上述物业出租前乙方所提供的服务</p>
    <p>1)房屋钥匙托管服务钥匙托管委托书见附件</p>
    <p>2)提供杂志、网站、邮件等多媒体平台的全面广告推广</p>
    <p>3)安排租客看房服务。</p>
    <p>4.2、甲方上述物业出租后乙方所提供的服务</p>
    <p>1)代表甲方做好房间入住前准备工作</p>
    <p>2)代为办理租客入住的相关手续和相关事宜</p>
    <p>3)入住检查完成后向甲方提交入住交接清单及报告</p>
    <p>4)准时向甲方转付押金及房租。</p>
    <p>4.3、甲方上述物业退租后乙方所提供的服务</p>
    <p>1)协助甲方进行物业退租及搬出检查</p>
    <p>2)协助甲方和租客结清各种费用</p>
    <p>3)积极为甲方寻找下一个租客</p>
    <p>第五条、合同争议解决方式</p>
    <p>1、双方协商解决</p>
    <p>
      2、协商不成依法向房屋所在地法院提起诉讼败诉方应支付所有包括律师费在内的相关法律费用。
    </p>
    <p>第六条、本合同壹式两份甲乙双方各执一份经双方签字或盖章后生效。</p>
    <p>委托人签字：<span class="info">{{ contract.principal }}</span></p>
    <p>日期：<span class="info">{{ contract.date_A | formatDate }}</span></p>
    <p>受托人(代表)签字：<span class="info">{{ contract.appointee }}</span></p>
    <p>日期：<span class="info">{{ contract.date_B | formatDate }}</span></p>
    <p><strong>关于房屋委托租赁合同</strong></p>
    <p>委托方：(以下简称甲方)</p>
    <p>受托方：(以下简称乙方)</p>
    <p>
      根据《中华人民共和国合同法》及有关规定，就甲方委托乙方出租自有房产一事，经双方协商一致，签订本协议。具体条款如下：
    </p>
    <p>第一条房产位置、面积和用途</p>
    <p>
      一、甲方将自有的坐落于北海市银海区金海岸大道59号森海豪庭幢，建筑面积平方米(以下简称该房屋)，委托给乙方出租。
    </p>
    <p>
      二、乙方如需改变该房产的内部结构、使用空间时，须事前征得甲方的书面同意。
    </p>
    <p>第二条委托期限</p>
    <p>
      首度委托限期为年：自年月日起至年月日止。首度委托期限期满后，双方应协商续签租赁协议。
    </p>
    <p>第三条房屋的租赁排序</p>
    <p>
      一、乙方所接受委托出租房屋的租赁使用排序严格按照签定本协议的先后次序进行计算机程序自动循环排序。该程序的修改密码由将来的业主委员会掌握，其他任何人不得私自改动，甲乙双方只能输入或查询，在未经业主委员会同意的情况下，不能进
    </p>
    <p>行任何修改。</p>
    <p>
      二、如遇在委托期限内甲方自己使用该房屋时，则计算机程序自动将该房屋的排序放在最后，进行重新排序。甲乙双方签定的本协议将继续有效。
    </p>
    <p>
      三、甲方若要自行使用该房屋，工作日须提前一天通知乙方，遇法定节假日须提前三天通知乙方。乙方在接到甲方通知后，视为
    </p>
    <p>
      该房屋出租一次，计算机程序自动将该房屋的租赁排序放到最后，若甲方未能按约使用该房屋，计算机程序亦自动将该房屋
    </p>
    <p>
      的租赁排序放到最后，若在甲方通知乙方之前，该房屋已出租或被预定，则乙方有权将甲方安排在其它房间。
    </p>
    <p>
      四、在委托期限内，甲方自行寻找的客户，不按电脑排序安排房间，可直接租赁甲方委托乙方出租的房间，同时计算机程序亦自动将甲方房间的租赁排序放到最后。
    </p>
    <p>第四条经营利润及支付方式</p>
    <p>一、乙方在协议期间可将该房屋按照市场价格出租给第三者使用。</p>
    <p>
      二、该房屋出租所得毛收入在扣除以下各项费用后即为该房屋的经营利润：
    </p>
    <p>
      1、乙方的经营管理费。如管理及服务人员工资、员工福利、奖励佣金、酒店经营营业税等;
    </p>
    <p>
      2、酒店消耗品。如酒店消耗品(包括卫生纸、小香皂、牙膏牙刷、洗发水、浴液、一次性拖鞋、一次性纸杯、信封信纸、鞋擦、卫生袋、垃圾袋、保洁用品、消毒用品等);
    </p>
    <p>
      3、冷热水费、电费、电话费、燃气费、有线电视收视费等;甲方在协议期间将以上1至3条所示费用的总和控制在房屋出租所得毛收入的30%以内。
    </p>
    <p>三、经营利润的支付时间、方式：</p>
    <p>1.乙方需在次月15日前向甲方支付当月经营利润。</p>
    <p>
      2.乙方可以用现金、银行转帐支票、银行汇款的方式向甲方支付经营利润。
    </p>
    <p>第五条甲方权利义务</p>
    <p>一、在委托租赁期间开始时向乙方提供该房屋。</p>
    <p>
      二、在协议期内，甲方需保证委托给乙方经营管理的房屋内的家具、电器等所有配套设施、设备，完全按照甲方自本项目开发商处
    </p>
    <p>
      接受该房屋时的全套配置，一并交与乙方，甲方不得私自搬走或更换，并按照第四条第二款中的规定承担实际发生的经营费用。
    </p>
    <p>
      三、协议期间，应按北京市有关规定缴纳因租赁房屋所放生的各项税费(由乙方代扣代缴)。
    </p>
    <p>
      四、甲方在将房屋委托给乙方时，必须交清房屋的维修基金、本年度物业管理费、冬季采暖费、房屋内财产保险费等费用。否则在
    </p>
    <p>协议期限内，乙方有权终止本协议。</p>
    <p>
      五、在协议期间，甲方可随时查询房屋出租情况，甲方可采用以下办理查询：
    </p>
    <p>1、乙方设立网站，随时反映酒店的房屋出租情况，供业主查询;</p>
    <p>2、酒店大堂设有自动查询机，机内记录当月的房屋出租记录;</p>
    <p>
      3、乙方每天将房屋经营情况打单记录供甲方随时查询，记录期为一年，同时乙方定期向甲方寄送。
    </p>
    <p>第六条乙方权利义务</p>
    <p>
      一、对该房屋作自由转租经营，但不得将其用于非法活动，且不得在房屋内存放危险物品。
    </p>
    <p>二、物业管理服务协议规定向甲方收取该房屋的各项管理费用。</p>
    <p>三、保证该房屋在租赁期间内部的清洁卫生。</p>
    <p>a)保证该房屋及内部配套设施等在租赁期间的良好使用状态。</p>
    <p>
      协议期满时应及时向甲方交付该房产，该房屋内原有家具、电器等应完好如数返还甲方，并保证房屋完好，如有损害、丢失的，应负责照价赔偿(房屋、家具、电器、床上用品、装修等自然损耗折扣除外)。
    </p>
    <p>
      c)按本协议约定的期限及方式向甲方支付租金，每延迟一日，按月租金的万分之三向甲方支付滞纳金。
    </p>
    <p>第七条经营利润分配</p>
    <p>
      委托出租房屋的经营利润以天为分配单位，并按照同类型房屋分别平均分配。计算方式如下：
    </p>
    <p>
      委托房屋的日经营利润=当日同类型房屋的经营利润总和&divide;当日委托出租同类型房屋的数量
    </p>
    <p>第八条设施、设备损坏责任及费用的承担</p>
    <p>
      一、本协议期内，凡因乙方人为或乙方出租给第三者所造成的设施、设备的损坏应由乙方负责更换并承担相应费用。
    </p>
    <p>
      二、在本协议期内，如因甲方使用所造成的设施、设备的损坏应由甲方负责更换承担相应费用。
    </p>
    <p>
      三、在本协议期内，该房屋及室内装修、设备、家具、电器、床上用品等的自然折旧费用由甲方承担。(详见第十条)
    </p>
    <p>第九条甲方自用房屋有关事宜</p>
    <p>一、甲方若自用房屋，则不参加使用当日的酒店经营利润分配。</p>
    <p>
      二、甲方临时自用房屋，若未按第三条第三款规定预先通知乙方，则乙方可视当时房屋出租情况予以安排，若确实无法安排时后果甲方自负。
    </p>
    <p>
      三、甲方若自用房屋，不必交付租金，但应当自行承担实际发生的水、电、电话费、酒店消耗品等费用。
    </p>
    <p>第十条固定资产重置费(折旧费)</p>
    <p>
      自甲方委托乙方经营之日起，第一年度固定资产重置费为零;第二年度起，每年从甲方应得的经营利润中提取4%作为固定资产重置费。该项费用专款专用，由乙方单独设立银行帐户予以保管，专用于房间装修维护、家用电器、床上用品、卫生洁具的修理与更新。该费用一旦动用须事先报请业主委员会审定，在业主委员会审定通过后方可使用。
    </p>
    <p>第十一条争议解决的方式</p>
    <p>
      本协议在履行过程中如发生争议，双方应协商解决，协商不成时，任何一方均可向仲裁委员会申请仲裁或向当地人民法院起诉。
    </p>
    <p>第十二条协议生效及其它</p>
    <p>
      一、甲方须交清房屋维修基金、本年度的物业管理费、冬季取暖费后，本协议方生效。
    </p>
    <p>二、本协议未尽事宜，甲、乙双方可另行签定补充协议。</p>
    <p>
      三、本协议执行期间，因不可抗力因素及政府政策原因，致使本协议无法履行时，双方均不承担违约责任。
    </p>
    <p>四、本协议一式叁份，甲方壹份、乙方两份。</p>
    <p>五、本协议自双方签字盖章后生效。</p>
    <p>(以下无正文)</p>
  </div>
</template>

<script>
import { getContract } from "@/api/house";

export default {
  name: "Contract",
  data: () => ({
    contract: {}
  }),
  created() {
    this.contract_id = this.$route.params.id;
    this.token = JSON.parse(localStorage.getItem("SH_token"));

    this.getContractInfo();
  },
  methods: {
    getContractInfo() {
      getContract({ id: this.contract_id }, this.token)
        .then(res => {
          switch (res.errno) {
            case 0:
              this.contract = res.data;
              break;
            default:
              break;
          }
        })
        .catch(err => {
          console.log(err);
        });
    }
  },
  filters: {
    formatDate(date, str) {
      date = new Date(date);
      const Year = date.getFullYear();
      const Month =
        date.getMonth() + 1 < 10
          ? `0${date.getMonth() + 1}`
          : date.getMonth() + 1;
      const Day = date.getDate() < 10 ? `0${date.getDate()}` : date.getDate();

      const Hours =
        date.getHours() < 10 ? `0${date.getHours()}` : date.getHours();
      const Minutes =
        date.getMinutes() < 10 ? `0${date.getMinutes()}` : date.getMinutes();
      const Seconds =
        date.getSeconds() < 10 ? `0${date.getSeconds()}` : date.getSeconds();

      switch (str) {
        case "YY-MM-DD hh:mm:ss":
          return `${Year}-${Month}-${Day} ${Hours}:${Minutes}:${Seconds}`;
        case "YY/MM/DD hh:mm:ss":
          return `${Year}/${Month}/${Day} ${Hours}:${Minutes}:${Seconds}`;
        case "YY-MM-DD":
          return `${Year}-${Month}-${Day}`;
        case "YY/MM/DD":
          return `${Year}/${Month}/${Day} ${Hours}:${Minutes}:${Seconds}`;
        case "hh:mm:ss":
          return `${Hours}:${Minutes}:${Seconds}`;
        default:
          return `${Year}年${Month}月${Day}日 ${Hours}:${Minutes}`;
      }
    }
  }
};
</script>

<style scoped lang="scss">
#contract {
  width: 1065px;
  margin: 0 auto;
  line-height: 1.8;
  padding: 40px 20px;
}

.title {
  text-align: center;
}

.info {
  color: red;
  font-size: 18px;
}
</style>
